; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph1 - mode
	infrared0 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	GroundStation4 - direction
	Star6 - direction
	GroundStation8 - direction
	Star9 - direction
	GroundStation10 - direction
	GroundStation3 - direction
	GroundStation7 - direction
	GroundStation5 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Star14 - direction
	Star15 - direction
	Star16 - direction
	Planet17 - direction
	Star18 - direction
	Star19 - direction
	Planet20 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star15)
)
(:goal (and
	(pointing satellite0 Star14)
	(have_image Planet11 infrared0)
	(have_image Planet12 infrared0)
	(have_image Planet13 infrared0)
	(have_image Star14 thermograph1)
	(have_image Star15 infrared0)
	(have_image Star16 infrared0)
	(have_image Planet17 thermograph1)
	(have_image Star18 thermograph1)
	(have_image Star19 thermograph1)
	(have_image Planet20 thermograph1)
))

)

; plan
1. (turn_to satellite0 groundstation3 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 11
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 11
3. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 11
4. (turn_to satellite0 star16 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star16)
   goals met: 0 of 11
5. (take_image satellite0 star16 instrument0 infrared0)
   added: (have_image star16 infrared0)
   goals met: 1 of 11
6. (turn_to satellite0 star15 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star15)
   goals met: 1 of 11
7. (take_image satellite0 star15 instrument0 infrared0)
   added: (have_image star15 infrared0)
   goals met: 2 of 11
8. (turn_to satellite0 planet20 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 planet20)
   goals met: 2 of 11
9. (take_image satellite0 planet20 instrument0 thermograph1)
   added: (have_image planet20 thermograph1)
   goals met: 3 of 11
10. (turn_to satellite0 planet17 planet20)
   deleted: (pointing satellite0 planet20)
   added: (pointing satellite0 planet17)
   goals met: 3 of 11
11. (take_image satellite0 planet17 instrument0 thermograph1)
   added: (have_image planet17 thermograph1)
   goals met: 4 of 11
12. (turn_to satellite0 planet13 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 planet13)
   goals met: 4 of 11
13. (take_image satellite0 planet13 instrument0 infrared0)
   added: (have_image planet13 infrared0)
   goals met: 5 of 11
14. (turn_to satellite0 planet12 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet12)
   goals met: 5 of 11
15. (take_image satellite0 planet12 instrument0 infrared0)
   added: (have_image planet12 infrared0)
   goals met: 6 of 11
16. (turn_to satellite0 planet11 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet11)
   goals met: 6 of 11
17. (take_image satellite0 planet11 instrument0 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 7 of 11
18. (turn_to satellite0 star18 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star18)
   goals met: 7 of 11
19. (take_image satellite0 star18 instrument0 thermograph1)
   added: (have_image star18 thermograph1)
   goals met: 8 of 11
20. (turn_to satellite0 star19 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 star19)
   goals met: 8 of 11
21. (take_image satellite0 star19 instrument0 thermograph1)
   added: (have_image star19 thermograph1)
   goals met: 9 of 11
22. (turn_to satellite0 star14 star19)
   deleted: (pointing satellite0 star19)
   added: (pointing satellite0 star14)
   goals met: 10 of 11
23. (take_image satellite0 star14 instrument0 thermograph1)
   added: (have_image star14 thermograph1)
   goals met: 11 of 11
